---
title: "Data Science with Pandas (part 1)"
format: html
execute: 
  enabled: true
---

# Data Science with pandas (part 2)

## Combining data frames

In many real life cases, you may find data saved into different files and, therefore, you may need to deal with several different pandas DataFrames. In the previous session, we saw how can we easily run statistical analysis on a single DataFrame, so that, ideally, we would like to have all the relevant data for our analysis inside a single DataFrame. <br>
In this session we will explore different ways of combining DataFrames into a single DataFrame.

Let's start loading the pandas library, reading two data sets into pandas DataFrames, and having a quick look at the tabular data: ```surveys.csv``` and ```species.csv```

In [18]:
import pandas as pd

In [ ]:
surveys_df = pd.read_csv("../data/surveys.csv", keep_default_na=False, na_values=[""])
species_df = pd.read_csv("../data/species.csv", keep_default_na=False, na_values=[""])

In [11]:
print(surveys_df.info())
print('='*72)
surveys_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35549 entries, 0 to 35548
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   record_id        35549 non-null  int64
 1   month            35549 non-null  int64
 2   day              35549 non-null  int64
 3   year             35549 non-null  int64
 4   plot_id          35549 non-null  int64
 5   species_id       34786 non-null  object
 6   sex              33038 non-null  object
 7   hindfoot_length  31438 non-null  float64
 8   weight           32283 non-null  float64
dtypes: float64(2), int64(5), object(2)
memory usage: 2.4+ MB
None
========================================================================

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN

In [12]:
print(species_df.info())
print('='*72)
species_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54 entries, 0 to 53
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   species_id  54 non-null     object
 1   genus       54 non-null     object
 2   species     54 non-null     object
 3   taxa        54 non-null     object
dtypes: object(4)
memory usage: 1.8+ KB
None
========================================================================

  species_id             genus          species    taxa
0         AB        Amphispiza        bilineata    Bird
1         AH  Ammospermophilus          harrisi  Rodent
2         AS        Ammodramus       savannarum    Bird
3         BA           Baiomys          taylori  Rodent
4         CB   Campylorhynchus  brunneicapillus    Bird

### Concatenating DataFrames

The first way we will combine DataFrames is **concatenation**, i.e. simply putting DataFrames one after the other either **verically** or **horizontally**. To concatenate two DataFrames you will use the function ```pd.concat```, specifying as arguments the DataFrames to concatenate and ```axis=0``` or ```axis=1``` for vertical or horizontal concatenation, respectively.

To play a bit with DataFrame concatenation, we will use subsets of the DataFrames we just read. In particular, we will work with two sub-DataFrames obtained selecting the first and the last 10 rows of the ```surveys.csv``` dataset.

In [22]:
# Subsetting data frames
surveys_df_sub_first10 = surveys_df.head(10)
surveys_df_sub_last10  = surveys_df.tail(10)

Let's start with vertical stacking. In this case the two DataFrames are simply stacked on top of each other (remember to specify ```axis=0```).
<div>
<img src="pictures/vertical_stacking.jpeg" width="300"/>
</div>

In [14]:
# Stack the DataFrames on top of each other
vertical_stack = pd.concat([surveys_df_sub_first10, surveys_df_sub_last10], axis=0)

In [15]:
print(vertical_stack.info())
print('='*72)
vertical_stack

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20 entries, 0 to 35548
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   record_id        20 non-null     int64
 1   month            20 non-null     int64
 2   day              20 non-null     int64
 3   year             20 non-null     int64
 4   plot_id          20 non-null     int64
 5   species_id       19 non-null     object
 6   sex              16 non-null     object
 7   hindfoot_length  15 non-null     float64
 8   weight           6 non-null      float64
dtypes: float64(2), int64(5), object(2)
memory usage: 1.6+ KB
None

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN
5,6,7,16,1977,1,PF,M,14.0,NaN
6,7,7,16,1977,2,PE,F,NaN,NaN
7,8,7,16,1977,1,DM,M,37.0,NaN
8,9,7,16,1977,1,DM,F,34.0,NaN
9,10,7,16,1977,6,PF,F,20.0,NaN
35539,35540,12,31,2002,15,PB,F,26.0,23.0
35540,35541,12,31,2002,15,PB,F,24.0,31.0
35541,35542,12,31,2002,15,PB,F,26.0,29.0
35542,35543,12,31,2002,15,PB,F,27.0,34.0
35543,35544,12,31,2002,15,US,NaN,NaN,NaN
35544,35545,12,31,2002,15,AH,NaN,NaN,NaN
35545,35546,12,31,2002,15,AH,NaN,NaN,NaN
35546,35547,12,31,2002,10,RM,F,15.0,14.0
35547,35548,12,31,2002,7,DO,M,36.0,51.0
35548,35549,12,31,2002,5,NaN,NaN,NaN,NaN

The resulting DataFrame (```vertical_stack```) consists, as expected, of 20 rows. These are the result of the first and last 10 rows of out original DataFrame ```surveys_df```. You may have noticed that the last ten rows have very high index, not consecutive with the first ten rows. This is because concatenation preserves the indices of the two original DataFrames. If you want a brand new set of indices for your concateneted DataFrame, simply resets the indices using the method ```.reset_index()```.

In [16]:
vertical_stack.reset_index()

,index,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,0,1,7,16,1977,2,NL,M,32.0,NaN
1,1,2,7,16,1977,3,NL,M,33.0,NaN
2,2,3,7,16,1977,2,DM,F,37.0,NaN
3,3,4,7,16,1977,7,DM,M,36.0,NaN
4,4,5,7,16,1977,3,DM,M,35.0,NaN
5,5,6,7,16,1977,1,PF,M,14.0,NaN
6,6,7,7,16,1977,2,PE,F,NaN,NaN
7,7,8,7,16,1977,1,DM,M,37.0,NaN
8,8,9,7,16,1977,1,DM,F,34.0,NaN
9,9,10,7,16,1977,6,PF,F,20.0,NaN
10,35539,35540,12,31,2002,15,PB,F,26.0,23.0
11,35540,35541,12,31,2002,15,PB,F,24.0,31.0
12,35541,35542,12,31,2002,15,PB,F,26.0,29.0
13,35542,35543,12,31,2002,15,PB,F,27.0,34.0
14,35543,35544,12,31,2002,15,US,NaN,NaN,NaN
15,35544,35545,12,31,2002,15,AH,NaN,NaN,NaN
16,35545,35546,12,31,2002,15,AH,NaN,NaN,NaN
17,35546,35547,12,31,2002,10,RM,F,15.0,14.0
18,35547,35548,12,31,2002,7,DO,M,36.0,51.0
19,35548,35549,12,31,2002,5,NaN,NaN,NaN,NaN

<div class="alert alert-block alert-warning">
<b>TRY IT YOURSELF</b>: In the given example of vertical concatenation, you concatenated two DataFrame with the same columns. What would happen if the two DataFrames to concatenate have different column number and names?
    <ol>
        <li>Create a new DataFrame using the last 10 rows of the species DataFrame</li>
        <li>Concatenate vertically ```surveys_df_sub_first_10``` and your just created DataFrame</li>
        <li>Print the concatenated DataFrame info on the screen. How may rows does it have? What happened to the columns? Can you tell, finally, what happens when you concatenate two DataFrames with different columns?
    </ol>
</div>

It's now time to try horizontal stacking. In this case the two DataFrames are simply stacked one after  one other (remember to specify ```axis=1```).
<div>
<img src="pictures/horizontal_stacking.jpeg" width="300"/>
</div>

In [23]:
# Place the DataFrames side by side
horizontal_stack = pd.concat([surveys_df_sub_first10, surveys_df_sub_last10], axis=1)

In [24]:
print(horizontal_stack.info())
print('='*72)
horizontal_stack

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20 entries, 0 to 35548
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   record_id        10 non-null     float64
 1   month            10 non-null     float64
 2   day              10 non-null     float64
 3   year             10 non-null     float64
 4   plot_id          10 non-null     float64
 5   species_id       10 non-null     object
 6   sex              10 non-null     object
 7   hindfoot_length  9 non-null      float64
 8   weight           0 non-null      float64
 9   record_id        10 non-null     float64
 10  month            10 non-null     float64
 11  day              10 non-null     float64
 12  year             10 non-null     float64
 13  plot_id          10 non-null     float64
 14  species_id       9 non-null      object
 15  sex              6 non-null      object
 16  hindfoot_length  6 non-null      float64
 17  weight           6 non-null      float64
dtypes: float64(14), object(4)
memory usage: 3.0+ KB
None
========================================================================

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1.0,7.0,16.0,1977.0,2.0,NL,M,32.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2.0,7.0,16.0,1977.0,3.0,NL,M,33.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3.0,7.0,16.0,1977.0,2.0,DM,F,37.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4.0,7.0,16.0,1977.0,7.0,DM,M,36.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5.0,7.0,16.0,1977.0,3.0,DM,M,35.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,6.0,7.0,16.0,1977.0,1.0,PF,M,14.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,7.0,7.0,16.0,1977.0,2.0,PE,F,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,8.0,7.0,16.0,1977.0,1.0,DM,M,37.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,9.0,7.0,16.0,1977.0,1.0,DM,F,34.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,10.0,7.0,16.0,1977.0,6.0,PF,F,20.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
35539,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35540.0,12.0,31.0,2002.0,15.0,PB,F,26.0,23.0
35540,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35541.0,12.0,31.0,2002.0,15.0,PB,F,24.0,31.0
35541,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35542.0,12.0,31.0,2002.0,15.0,PB,F,26.0,29.0
35542,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35543.0,12.0,31.0,2002.0,15.0,PB,F,27.0,34.0
35543,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35544.0,12.0,31.0,2002.0,15.0,US,NaN,NaN,NaN
35544,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35545.0,12.0,31.0,2002.0,15.0,AH,NaN,NaN,NaN
35545,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35546.0,12.0,31.0,2002.0,15.0,AH,NaN,NaN,NaN
35546,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35547.0,12.0,31.0,2002.0,10.0,RM,F,15.0,14.0
35547,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35548.0,12.0,31.0,2002.0,7.0,DO,M,36.0,51.0
35548,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35549.0,12.0,31.0,2002.0,5.0,NaN,NaN,NaN,NaN

Looking at the result of our horizontal concatenation, we may realise that something went wrong. The total number of row on the resulting DataFrame is 20, that is not what we would expect from a horizontal stacking (we where expecting 10 rows, as the initial DataFrames). This happens because horizontal stacking is based on index and our two DataFrames have different indices (1-9 and 35539-35548 respectively). In order to properly stack the DataFrame we need first to reset the indeces of the second DataFrame so that they will match the ones of the first DataFrame.

In [25]:
surveys_df_sub_last10 = surveys_df_sub_last10.reset_index(drop=True)

In [26]:
surveys_df_sub_last10

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,35540,12,31,2002,15,PB,F,26.0,23.0
1,35541,12,31,2002,15,PB,F,24.0,31.0
2,35542,12,31,2002,15,PB,F,26.0,29.0
3,35543,12,31,2002,15,PB,F,27.0,34.0
4,35544,12,31,2002,15,US,NaN,NaN,NaN
5,35545,12,31,2002,15,AH,NaN,NaN,NaN
6,35546,12,31,2002,15,AH,NaN,NaN,NaN
7,35547,12,31,2002,10,RM,F,15.0,14.0
8,35548,12,31,2002,7,DO,M,36.0,51.0
9,35549,12,31,2002,5,NaN,NaN,NaN,NaN

Now that the index has been reset, we can concatenate this DataFrame with the first 10 lines DataFrame.

In [27]:
horizontal_stack = pd.concat([surveys_df_sub_first10, surveys_df_sub_last10], axis=1)

In [28]:
print(horizontal_stack.info())
print('='*72)
horizontal_stack

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   record_id        10 non-null     int64
 1   month            10 non-null     int64
 2   day              10 non-null     int64
 3   year             10 non-null     int64
 4   plot_id          10 non-null     int64
 5   species_id       10 non-null     object
 6   sex              10 non-null     object
 7   hindfoot_length  9 non-null      float64
 8   weight           0 non-null      float64
 9   record_id        10 non-null     int64
 10  month            10 non-null     int64
 11  day              10 non-null     int64
 12  year             10 non-null     int64
 13  plot_id          10 non-null     int64
 14  species_id       9 non-null      object
 15  sex              6 non-null      object
 16  hindfoot_length  6 non-null      float64
 17  weight           6 non-null      float64
dtypes: float64(4), int64(10), object(4)
memory usage: 1.5+ KB
None
========================================================================

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN,35540,12,31,2002,15,PB,F,26.0,23.0
1,2,7,16,1977,3,NL,M,33.0,NaN,35541,12,31,2002,15,PB,F,24.0,31.0
2,3,7,16,1977,2,DM,F,37.0,NaN,35542,12,31,2002,15,PB,F,26.0,29.0
3,4,7,16,1977,7,DM,M,36.0,NaN,35543,12,31,2002,15,PB,F,27.0,34.0
4,5,7,16,1977,3,DM,M,35.0,NaN,35544,12,31,2002,15,US,NaN,NaN,NaN
5,6,7,16,1977,1,PF,M,14.0,NaN,35545,12,31,2002,15,AH,NaN,NaN,NaN
6,7,7,16,1977,2,PE,F,NaN,NaN,35546,12,31,2002,15,AH,NaN,NaN,NaN
7,8,7,16,1977,1,DM,M,37.0,NaN,35547,12,31,2002,10,RM,F,15.0,14.0
8,9,7,16,1977,1,DM,F,34.0,NaN,35548,12,31,2002,7,DO,M,36.0,51.0
9,10,7,16,1977,6,PF,F,20.0,NaN,35549,12,31,2002,5,NaN,NaN,NaN,NaN

<div class="alert alert-block alert-warning">
<b>TRY IT YOURSELF</b>: In the given example of horizontal concatenation, you first concatenated two DataFrame with different indices, then reset the indices of the second one. Base on the outcome of these two cases, try to answer the following questions:
    <ol>
        <li>What happens when you concatenate horizontally two DataFrames with different indexing?</li>
        <li>What happens when you concatenate horizontally two DataFrames with the same columns?</li>
        <li>What happens when you try to select a column of the just horizontally concatenated DataFrame?></li>
        <li>How can you select a specific columns among duplicates?</li>
    </ol>
</div>